Revit 2017 API
ShapeImporter Methods
The ShapeImporter type exposes the following members.
Methods
Name | Description
Convert
 Converts the geometry stored in the external format into a collection of Revit geometry objects.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsServiceAvailable
 Checks whether the data conversion service is available.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace